rhgndf/py32-data/svd/PY32T090xx.svd
        <register>
          <name>CCR</name>
          <addressOffset>0x308</addressOffset>
          <fields>
            <field>
              <name>CKMODE</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>PRESC</name>
              <bitRange>[21:18]</bitRange>
            </field>
            <field>
              <name>VREFENT_EN</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>TSEN</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>PWR_MODE</name>
              <bitRange>[27:25]</bitRange>
            </field>
            <field>
              <name>VSENSESEL</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>DIFF_EN</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>ADC_DBGSEL</name>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>BKP_TAMP</name>
      <baseAddress>0x4000B000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x180</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>TAMP_CR1</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>TAMP1EN</name>
              <description>TAMP enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ITAMP1EN</name>
              <description>TAMPER pin interrupt enable</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_CR2</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>TAMP1NOER</name>
              <description>TAMP not erase enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TAMP1MSK</name>
              <description>TAMP enable</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>TAMP1TRG</name>
              <description>TAMPER pin interrupt enable</description>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_FLTCR</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>TAMPFREQ</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>RAMPFLT</name>
              <bitRange>[4:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_IER</name>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>TAMP1IE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ITAMP1IE</name>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_SR</name>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>TAMP1IF</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ITAMP1F</name>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_MISR</name>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>TAMP1MF</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ITAMP1MF</name>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_SCR</name>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>CTAMP1F</name>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CITAMP1F</name>
              <bitRange>[16:16]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP0R</name>
          <addressOffset>0x100</addressOffset>
          <fields>
            <field>
              <name>BKP</name>
              <description>bakeup data word0</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP1R</name>
          <addressOffset>0x104</addressOffset>
          <fields>
            <field>
              <name>BKP</name>
              <description>bakeup data word1</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP2R</name>
          <addressOffset>0x108</addressOffset>
          <fields>
            <field>
              <name>BKP</name>
              <description>bakeup data word2</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP3R</name>
          <addressOffset>0x10C</addressOffset>
          <fields>
            <field>
              <name>BKP</name>
              <description>bakeup data word3</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP4R</name>
          <addressOffset>0x110</addressOffset>
          <fields>
            <field>
              <name>BKP</name>
              <description>bakeup data word4</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP5R</name>
          <addressOffset>0x114</addressOffset>
          <fields>
            <field>
              <name>BKP</name>
              <description>bakeup data word5</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP6R</name>
          <addressOffset>0x118</addressOffset>
          <fields>
            <field>
              <name>BKP</name>
              <description>bakeup data word6</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMP_BKP7R</name>
          <addressOffset>0x11C</addressOffset>
          <fields>
            <field>
              <name>BKP</name>
              <description>bakeup data word7</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
