rhgndf/py32-data/svd/PY32T090xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP_COMMON</name>
      <description>Comparator</description>
      <groupName>COMP</groupName>
      <baseAddress>0x40010208</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x04</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ADC_COMP</name>
        <description>ADC and COMP Interrupt through EXTI Lines 17 and 18</description>
        <value>12</value>
      </interrupt>
      <registers>
        <register>
          <name>CCSR</name>
          <displayName>CCSR</displayName>
          <description>COMP control and status register</description>
          <addressOffset>0x00</addressOffset>
          <fields>
            <field>
              <name>VREFCMP_EN</name>
              <description>VREFCMP enable bit</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>VCDIV</name>
              <description>COMP1,COMP2 voltage divider selection</description>
              <bitRange>[6:1]</bitRange>
            </field>
            <field>
              <name>SSEL</name>
              <description>VREFCMP Voltage Source Selection</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CRC</name>
      <description>CRC calculation unit</description>
      <baseAddress>0x40023000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DR</name>
          <description>Data register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>DR</name>
              <description>CRC data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <description>Independent Data register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>IDR</name>
              <description>CRC independent data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>Control register</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>RESET</name>
              <description>CRC software reset</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>POLYSIZE</name>
              <description>Polynomial size</description>
              <bitRange>[4:3]</bitRange>
            </field>
            <field>
              <name>REV_IN</name>
              <description>Reverse input data</description>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>REV_OUT</name>
              <description>Reverse output data</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INIT</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>INIT</name>
              <description>initial value</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>POL</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>POL</name>
              <description>polynomial</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DAC</name>
      <description>desc DAC</description>
      <baseAddress>0x40007400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TIM6_LPTIM1_DAC</name>
        <description>TIM6, LPTIM1, DAC global Interrupts</description>
        <value>17</value>
      </interrupt>
      <registers>
        <register>
          <name>CR1</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BOFF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TSEL</name>
              <bitRange>[5:3]</bitRange>
            </field>
            <field>
              <name>WAVE</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>MAMP</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>DMAEN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>DMAUDRIE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>DACCEN</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>BUF_CAL</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>SWTRIG</name>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>VREFSEL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>INTEREN</name>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12R</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>DACDHR</name>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12L</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>DACDHR</name>
              <bitRange>[15:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR8R</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>DACDHR</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DOR</name>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>DACDOR</name>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>desc SR</description>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>DMAUDR</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CALR</name>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>DAC_OS_TRIMCR_VCC</name>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>DAC_OS_TRIMCR_VREFBUF</name>
              <bitRange>[11:6]</bitRange>
            </field>
            <field>
              <name>DAC_DOUT</name>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DAC_CR</name>
              <bitRange>[21:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
