rhgndf/py32-data/svd/PY32T090xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PWR</name>
      <description>Power control</description>
      <baseAddress>0x40007000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR1</name>
          <description>Power control register 1</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>LPMS</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>DBP</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>VR_MODE</name>
              <bitRange>[10:9]</bitRange>
            </field>
            <field>
              <name>FLS_SLPTIME</name>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MR_VSEL</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>LPR_VSEL</name>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>DLPR_VSEL</name>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>FLSSLP_CTRL</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>HSION_CTRL</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>STDBY_MRRDY_WAIT</name>
              <bitRange>[27:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>Power control register 2</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>PVDE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PVDT</name>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>PVD_OUT_SEL</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FLTEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FLT_TIME</name>
              <bitRange>[11:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR3</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>EWUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EWUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EWUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EWUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EWUP4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EWUP5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EWUP6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EWUP7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LD_EN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>APC</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SRAM1PDSTD</name>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR4</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>WP0</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>WP1</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>WP2</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>WP3</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>WP4</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>WP5</name>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>WP6</name>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>WP7</name>
              <bitRange>[15:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Power status register</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>WUF0</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WUF1</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WUF2</name>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WUF3</name>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WUF4</name>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WUF5</name>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WUF6</name>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WUF7</name>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SBF</name>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MR_RDY</name>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MR_VOS_RDY</name>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LPRUN_RUN_SWF</name>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>IWDGRST_WUF</name>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PINRST_WUF</name>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>VCC_PORF</name>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PVDO</name>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCR</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>CWUF0</name>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CWUF1</name>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CWUF2</name>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CWUF3</name>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CWUF4</name>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CWUF5</name>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CWUF6</name>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CWUF7</name>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CSBF</name>
              <bitRange>[8:8]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CIWDGRSTWUF</name>
              <bitRange>[12:12]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CPINRSTWUF</name>
              <bitRange>[13:13]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CVCCPORF</name>
              <bitRange>[14:14]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PUCRA</name>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>PU0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PU1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PU2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PU3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PU4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PU5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PU6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PU7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PU8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PU9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>PU10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>PU11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>PU12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>PU13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>PU14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>PU15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PDCRA</name>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>PD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>PD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>PD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>PD12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>PD13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>PD14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>PD15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PUCRB</name>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>PU0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PU1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PU2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PU3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PU4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PU5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PU6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PU7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PU8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PU9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>PU10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>PU11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>PU12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>PU13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>PU14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>PU15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PDCRB</name>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>PD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>PD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>PD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>PD12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>PD13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>PD14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>PD15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PUCRC</name>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>PU0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PU1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PU2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PU3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PU4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PU5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PU6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PU7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PU8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PU9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>PU10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>PU11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>PU12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>PU13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>PU14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>PU15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PDCRC</name>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>PD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PD8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>PD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>PD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>PD12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>PD13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>PD14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>PD15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
