rhgndf/py32-data/svd/PY32T090xx.svd
        <register>
          <name>APBENR2</name>
          <description>APB peripheral clock enable register 2</description>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>SYSCFGEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TIM1EN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI1EN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>USART1EN</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TIM15EN</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>TIM16EN</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>TIM17EN</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADCEN</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>COMP1EN</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>COMP2EN</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>COMP3EN</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>LCDEN</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>TKEN</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>VREFBUFEN</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR</name>
          <description>Peripherals independent clock configuration register</description>
          <addressOffset>0x54</addressOffset>
          <fields>
            <field>
              <name>TIMCLKCTRL</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PVDSEL</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>COMP1SEL</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>COMP2SEL</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>COMP3SEL</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>LPUART1SEL</name>
              <bitRange>[12:11]</bitRange>
            </field>
            <field>
              <name>LPUART2SEL</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>LPTIM1SEL</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>LPTIM2SEL</name>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>PWMSEL</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>ADCSEL</name>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BDCR</name>
          <description>RTC domain control register</description>
          <addressOffset>0x5C</addressOffset>
          <fields>
            <field>
              <name>LSERDY</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LSEBYP</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LSEDRV</name>
              <bitRange>[4:3]</bitRange>
            </field>
            <field>
              <name>LSECSSON</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LSECSSD</name>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RTCSEL</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>LSEEN</name>
              <bitRange>[13:10]</bitRange>
            </field>
            <field>
              <name>LSCSEL</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RTCEN</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>BDRST</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>LSI_TRIMCR</name>
              <bitRange>[25:17]</bitRange>
            </field>
            <field>
              <name>LSION</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>LSIRDY</name>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LSE_RDYSEL</name>
              <bitRange>[29:28]</bitRange>
            </field>
            <field>
              <name>IWDGSEL</name>
              <bitRange>[30:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR</name>
          <description>Control/status register</description>
          <addressOffset>0x60</addressOffset>
          <fields>
            <field>
              <name>NRST_FLTDIS</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RMVF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>OBLRSTF</name>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PINRSTF</name>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWRRSTF</name>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SFTRSTF</name>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>IWDGRSTF</name>
              <bitRange>[29:29]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WWDGRSTF</name>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LPWRRSTF</name>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
