rhgndf/py32-data/svd/PY32T090xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>UART1</name>
      <groupName>UART</groupName>
      <baseAddress>0x40004800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DR</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>DR</name>
              <description>Receive/send data register</description>
              <bitRange>[8:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BRR</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>BRR</name>
              <description>Baud rate register</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>RXNE</name>
              <description>Receive register not empty</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ORE</name>
              <description>Overrun error bit</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PE</name>
              <description>Parity Error bit</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>FE</name>
              <description>Framing Error bit</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>BRI</name>
              <description>Break Interrupt bit</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TDRE</name>
              <description>Transmit Holding Register Empty bit</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXE</name>
              <description>Transmitter Empty bit</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ADDR_RCVD</name>
              <description>Address Received Bit</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>BUSY</name>
              <description>UART Busy</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY_ERR</name>
              <description>Busy Detect Error</description>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR1</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>M</name>
              <description>Data Length Select</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>STOP</name>
              <description>Number of stop bits</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PCE</name>
              <description>Parity Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PS</name>
              <description>Even Parity Select</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SP</name>
              <description>Stick Parity</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SBK</name>
              <description>Send Break</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SWAP</name>
              <description>TX/RX pin swap</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>MSBFIRST</name>
              <description>MSB first mode</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>RXNEIE</name>
              <description>Enable Received Data Available Interrupt</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TDREIE</name>
              <description>Enable Transmit Holding Register Empty Interrupt</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LSIE</name>
              <description>Enable Receiver Line Status Interrupt</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>BUSYERRIE</name>
              <description>Enable Busyerr state interruption</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXEIE</name>
              <description>Enable tx empty interruption</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR3</name>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>M_E</name>
              <description>Extension for DLS</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADDR_MATCH</name>
              <description>Address Match Mode</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SEND_ADDR</name>
              <description>Send address control bit</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TX_MODE</name>
              <description>Transmit mode control bit</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DMAR</name>
              <description>DMA receive enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DMAT</name>
              <description>DMA transmit enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DMA_SOFT_ACK</name>
              <description>DMA software ack</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAR</name>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>RAR</name>
              <description>Receive address matching register</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAR</name>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>TAR</name>
              <description>Transmit address matching register</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BRRF</name>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>BRRF</name>
              <description>Baud rate fractional register</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
